
//
Процедура СоздатьЗаписиРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.Ссылка
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_ДействияНадДокументами КАК Диадок_ДействияНадДокументами
		|		ПО (Диадок_ДействияНадДокументами.Дд_Документ = Диадок_Документы.Ссылка)
		|ГДЕ
		|	Диадок_ДействияНадДокументами.Дд_Документ ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		мз = РегистрыСведений.Диадок_ДействияНадДокументами.СоздатьМенеджерЗаписи();
		мз.Дд_Документ = ВыборкаДетальныеЗаписи.Ссылка;
		мз.ТекущееСостояние = Перечисления.Диадок_СостояниеДокумента.НеОбработанный;
		мз.Записать(Истина);
		
	КонецЦикла;
	
	//Сообщить("Порядок!");
	
КонецПроцедуры

Процедура ВыполнитьДействияДляДокументов()   Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляСпискаДокументов();
	Запрос.УстановитьПараметр("ТекущееСостояние", Перечисления.Диадок_СостояниеДокумента.НеОбработанный);
	Запрос.УстановитьПараметр("Действие", Перечисления.Диадок_ТребуемыеДействия.ОтправитьПоМаршруту);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидДокумента = ВыборкаДетальныеЗаписи.ВидДокументаДокОборот;
		Проект = ВыборкаДетальныеЗаписи.Проект;
		Шаблон = ВыборкаДетальныеЗаписи.ШаблонБизнесПроцесса;
		ДокументСсылка = ВыборкаДетальныеЗаписи.ДокументСсылка;
		
		Если ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
			СоздатьВходящийДокуент(ДокументСсылка,ВидДокумента,Проект);	
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
			СоздатьВнутреннийДокуент(ДокументСсылка,ВидДокумента,Проект);
		ИначеЕсли ТипЗнч(ВидДокумента) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
			
		КонецЕсли;
		
		
	КонецЦикла;                                                                                                    
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаДляСпискаДокументов()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Диадок_Документы.Ссылка КАК ДокументСсылка,
	               |	Диадок_ДействияНадДокументами.Действие,
	               |	Диадок_ДействияНадДокументами.ТекущееСостояние,
	               |	Диадок_ДействияНадДокументами.ВидДокументаДокОборот,
	               |	Диадок_ДействияНадДокументами.ШаблонБизнесПроцесса,
	               |	Диадок_ДействияНадДокументами.Проект
	               |ИЗ
	               |	Справочник.Диадок_Документы КАК Диадок_Документы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_ДействияНадДокументами КАК Диадок_ДействияНадДокументами
	               |		ПО (Диадок_ДействияНадДокументами.Дд_Документ = Диадок_Документы.Ссылка)
	               |ГДЕ
	               |	Диадок_ДействияНадДокументами.ТекущееСостояние = &ТекущееСостояние
	               |	И Диадок_ДействияНадДокументами.Действие = &Действие";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СоздатьВходящийДокуент(ДокументСсылка,ВидДокумента,Проект)
	
КонецПроцедуры

Процедура СоздатьВнутреннийДокуент(ДокументСсылка,ВидДокумента,Проект)
	
КонецПроцедуры

Процедура ИзменитьСостояниеДокумента(ДДДокумент, Состояние)  экспорт
	
	мз = РегистрыСведений.Диадок_ДействияНадДокументами.СоздатьМенеджерЗаписи();
	мз.Дд_Документ = ДДДокумент;
	мз.Прочитать();
	мз.ТекущееСостояние = Состояние;
	мз.Записать(Истина);
	
КонецПроцедуры
